Repository: uncle-yura/alterx
Catalog: alterx/locales/*/LC_MESSAGES/*.po
Languages: ru

source: Preferences file is not exist.
ru: Файл настроек не существует.

source: Failed to get preference: {}
ru: Не удалось загрузить настройку: {}

source: Failed to send packet: {}
ru: Не удалось отправить пакет: {}

source: Failed to import LinuxCNC module: '{}'
ru: Не удалось импортировать модуль LinuxCNC: '{}'

source: AlterX: Failed to import LinuxCNC
ru: AlterX: Не удалось импортировать LinuxCNC

source: AlterX interface launched in recovery mode!
ru: Интерфейс AlterX запущен в режиме восстановления!

source: mm
ru: мм

source: deg
ru: град

source: rev
ru: об

source: min
ru: мин

source: Failed to poll LinuxCNC stat: '{}'
ru: Не удалось обновить статус LinuxCNC: '{}'

source: Failed to execute '{}' handler {}: '{}'
ru: Не удалось вызвать '{}' обработчик {}: '{}'

source: Failed to emit signal. Signal '{}' no exist
ru: Не удалось имитировать сигнал. Сигнал '{}' не существет

source: Failed to add listener. Listener '{}' already exist
ru: Не удалось добавить слушателя. Слушатель '{}' уже существет

source: Failed to add signal. Signal '{}' already exist
ru: Не удалось добавить сигнал. Сигнал '{}' уже существует

source: Failed to get atribute {}: {}
ru: Не удалось получить атрибут {}: {}

source: LinuxCNC postgui halfile: {}
ru: Загружаемый после интерфейса LinuxCNC hal-файл: {}

source: LinuxCNC hal input run signal activated
ru: Активирован LinuxCNC старт hal-сигнал

source: LinuxCNC hal input stop signal activated
ru: Активирован LinuxCNC стоп hal-сигнал

source: LinuxCNC display encoder signal {}
ru: Сигнал LinuxCNC экранного энкодера {}

source: LinuxCNC display input signals {}
ru: Сигналы LinuxCNC экранных входов {}

source: ESTOP
ru: А-СТОП

source: ESTOP RESET
ru: А-СТОП СБРОС

source: ON
ru: ВКЛ

source: OFF
ru: ВЫКЛ

source: None
ru: Ничего

source: LinuxCNC state {}
ru: Статус LinuxCNC {}

source: MANUAL
ru: РУЧНОЙ

source: AUTO
ru: АВТО

source: LinuxCNC mode {}
ru: Режим LinuxCNC {}

source: LinuxCNC homed {}
ru: LinuxCNC в нулях {}

source: Loaded: {}
ru: Загружено: {}

source: inch
ru: дюйм

source: cm
ru: см

source: Units: {}
ru: Единицы: {}

source: LinuxCNC mode {} {} {} {}
ru: LinuxCNC режим {} {} {} {}

source: Unknown button
ru: Неизвестная кнопка

source: Failed to execute cmd: {}
ru: Не удалось выполнить комманду: {}

source: Start Awlsim
ru: Запуск Awlsim

source: Failed to import awlsim, {}
ru: Не удалось импортировать awlsim, {}

source: Yes
ru: Да

source: No
ru: Нет

source: Next
ru: Следующий

source: Default hal file copy failed, {}
ru: Копирование стандартного hal-файла не удалось, {}

source: Config Editor
ru: Редактор конфигураций

source: Save
ru: Сохранить

source: Load
ru: Загрузить

source: Load default
ru: По-умолчанию

source: Save as
ru: Сохранить как

source: Run wizard
ru: Запуск помощника

source: COORDINATES not equal AXES
ru: COORDINATES не соответствует AXES

source: The number of axes and coordinates does not converge. Check [TRAJ]COORDINATES and [KINS]JOINTS
ru: Количество осей и координат не сходиться. Проверьте [TRAJ]COORDINATES и [KINS]JOINTS

source: Wrong core version
ru: Неправильная версия ядра

source: Invalid parameter [EMC]CORE.
ru: Неправильный параметр [EMC]CORE.

source: Can't find section
ru: Не удалось найти секцию

source: Can't find section. {}. Probably wrong core version.
ru: Не удалось найти секцию. {}. Вероятно неправильная версия ядра.

source: Add default axis exception: {}
ru: Исключение при добавлении оси: {}

source: Delete tab exception: {}
ru: Исключение при удалении вкладки: {}

source: Broken wizard line: {} {}
ru: Ошибка в строке помощника: {} {}

source: Stop wizard
ru: Остановить помощника

source: Delete section
ru: Удалить секцию

source: New option
ru: Новая опция

source: Add section exception: {}
ru: Исключение добавления секции: {}

source: INI-file arg is not found.
ru: Аргумент INI-файла не найден.

source: Option changed: {} {} {}
ru: Опция изменена: {} {} {}

source: Delete
ru: Удалить

source: Insert
ru: Вставить

source: Delete section exception: {}
ru: Исключение удаления секции: {}

source: Add new section
ru: Добавить секцию

source: Failed to delete path {}: {}
ru: Не удалось удалить путь {}: {}

source: Loading: {}
ru: Загрузка: {}

source: File path is not valid: {}
ru: Неправильный путь к файлу: {}

source: Program
ru: Программа

source: Filename:
ru: Имя файла:

source: Lines:
ru: Строки:

source: Progress:
ru: Прогресс:

source: Progress: {:2.2f}%
ru: Прогресс: {:2.2f}%

source: Filename: {}
ru: Имя файла: {}

source: Lines: {}
ru: Строки: {}

source: Editor
ru: Редактор

source: Search: {}
ru: Поиск: {}

source: Replace: {}
ru: Замена: {}

source: HAL Editor
ru: HAL редактор

source: Failed to get hal pin list: {}
ru: Не удалось получить список hal пинов: {}

source: Open
ru: Открыть

source: Failed to set hal path,{}
ru: Не удалось установить hal путь,{}

source: Failed to load hal-file {}
ru: Не удалось загрузить hal-файл {}

source: Failed to save hal-file, {}
ru: Не удалось сохранить hal-файл, {}

source: HAL Pin Viewer
ru: Просмотр HAL пинов

source: Name
ru: Имя

source: Type
ru: Тип

source: Dir.
ru: Напр.

source: Addr.
ru: Адр.

source: HAL type
ru: HAL тип

source: Osc.
ru: Осц.

source: Pin
ru: Пин

source: Value
ru: Значение

source: Name:
ru: Имя:

source: Run command
ru: Пуск комманды

source: Update tree
ru: Обновить дерево

source: HAL Pin
ru: HAL Пин

source: Run
ru: Пуск

source: Stop
ru: Стоп

source: Auto
ru: Авто

source: One Shot
ru: Одиночный

source: Change
ru: Смена

source: High
ru: Высокий

source: Low
ru: Низкий

source: Trigger signal:
ru: Сигнал триггера:

source: Trigger value:
ru: Значение триггера:

source: Oscilloscope
ru: Осцилограф

source: Failed to send run cmd: {}
ru: Не удалось отослать комманду: {}

source: Complete
ru: Готово

source: Reading
ru: Считывание

source: Idle
ru: Простой

source: Waiting
ru: Ожидание

source: Name: {}
ru: Имя: {}

source: HAL Pin viewer works only with loaded hal component 'ascope'.
ru: Просмотровщик HAL работает только с загруженным компонентом 'ascope'.

source: Invalid buttons order list for menu {}, {}
ru: Неправильный список порядка кнопок для меню {}, {}

source: No menu module with name: menus.{}.{}
ru: Нет модуля меню с именем: menus.{}.{}

source: Tool
ru: Инструмент

source: No tool
ru: Нет инструмента

source: No comment
ru: Нет комментария

source: Codes
ru: Коды

source: Spindlerate
ru: Шпиндель

source: Actual: {:.2f} {}/{}
ru: Акт.: {:.2f} {}/{}

source: SO: {}%
ru: ШП: {}%

source: Feedrate
ru: Подача

source: Actual: {:.2f}
ru: Акт.: {:.2f}

source: FO: {}%
ru: ПП: {}%

source: RO: {}%
ru: БП: {}%

source: Disactivated
ru: Заблокировано

source: Activated
ru: Активировано

source: Increment
ru: Инкремент

source: Continuous
ru: Продолжительный

source: Joystick
ru: Джойстик

source: Encoder
ru: Энкодер

source: JOG
ru: Ручные

source: Speed: {:.2f}
ru: Скорость: {:.2f}

source: Increment: {}
ru: Инкремент: {}

source: JOG
ru: Ручные

source: Mode:
ru: Режим:

source: Device:
ru: Устройство:

source: Speed: {}%
ru: Скорость: {}%

source: Axis
ru: Ось

source: Failed to emit button click: {}
ru: Не удалось имитировать нажатие кнопки: {}

source: Failed to load stylesheet: {}
ru: Не удалось загрузить стиль: {}

source: MDI history file path is not valid: {}
ru: Неправильный путь к файлу истории MDI: {}

source: Text: {}, Row: {}, Column: {}
ru: Текст: {}, Строка: {}, Колонка: {}

source: File does not exist: {}
ru: Файл не существет: {}

source: Reading parameter file failed: {}
ru: Не удалось прочитать файл параметров: {}

source: Offset data changed error {}
ru: Ошибка изменения данных отступа {}

source: Offsetpage widget error: MDI call error, {}
ru: Ошибка виджета Offsetpage: ошибка вызова MDI, {}

source: Set offset data failed: {}
ru: Ошибка установки данных отступа: {}

source: Error with path_viewer.Package python-pyqt5.qtopengl not installed.
ru: Ошибка path_viewer. Пакет python-pyqt5.qtopengl не установлен.

source: Error with path_viewer.Package python-opengl not installed.
ru: Ошибка path_viewer. Пакет python-opengl не установлен.

source: PathViewer load error: {}
ru: PathViewer ошибка загрузки: {}

source: No file loaded
ru: Файл не загружен

source: generated from %s
ru: сгенерировано из %s

source: %(size)s bytes %(lines)s gcode lines
ru: %(size)s байт %(lines)s gcode строк

source: %.1f Minutes
ru: %.1f Минуты

source: %d Seconds
ru: %d Секунды

source: %(a)f to %(b)f = %(diff)f %(units)s
ru: %(a)f в %(b)f = %(diff)f %(units)s

source: 3D plot, Can't load backplot, invalid file: {}
ru: 3D чертеж, не удалось загрузить чертеж, неправильный файл: {}

source: 3D plot, Error in {} line {} {}
ru: 3D чертеж, ошибка в {} строка {} {}

source: alterx ERROR: {}
ru: alterx ОШИБКА: {}

source: Press enter to exit.
ru: Нажмите enter для выхода.

source: Deprecated QString API detected. AlterX does not support PyQt QString v1 API. ---> Please use PySide2 or a newer PyQt5. <---
ru: Обнаружено устаревшее QString API. AlterX не поддерживает PyQt QString v1 API. ---> Установите PySide2 или PyQt5. <---

source: Failed to import PySide2 modules: {}
ru: Не удалось импортировать модули PySide2: {}

source: Failed to import PyQt5 modules: {}
ru: Не удалось импортировать модули PyQt5: {}

source: Unknown GUI framework '{}' requested. Please fix the ALTERX_GUI environment variable.
ru: Неизвестный фреймворк GUI '{}' запрошен. Исправьте переменную среды ALTERX_GUI.

source: Status
ru: Статус

source: Parameters
ru: Параметры

source: Failed to load parameter file: {}
ru: Не удалось загрузить файл параметров: {}

source: New
ru: Новый

source: Failed to delete parameter: {}
ru: Не удалось удалить параметр: {}

source: Stylesheet Editor
ru: Редактор стилей

source: Copy and Edit
ru: Скопировать и редактировать

source: View
ru: Просмотр

source: Color
ru: Цвет

source: Font
ru: Шрифт

source: Apply
ru: Применить

source: Clear
ru: Очистить

source: Edit
ru: Редактировать

source: Style sheet editor
ru: Редактор стилей

source: Failed to set stylesheet path,{}
ru: Не удалось установить путь к стилю,{}

source: Failed to load stylesheet {}
ru: Не удалось загрузить стиль {}

source: Failed to save stylesheet {}
ru: Не удалось сохранить стиль {}

source: Invalid tabs order list, {}
ru: Неправильный список порядка вкладок, {}

source: No menu tab with name: tabs.{}
ru: Нет вкладки меню с именем: tabs.{}

source: Add tool request: {}
ru: Запрос добавления инструмента: {}

source: Failed to find new tool number
ru: Не удалось найти новый номер инструмента

source: Delete tool request: {}
ru: Запрос удаления инструмента: {}

source: Failed to get tool info: {}
ru: Не удалось получить информацию об инструменте: {}

source: Pocket
ru: Карман

source: X Wear
ru: X износ

source: Y Wear
ru: Y износ

source: Z Wear
ru: Z износ

source: Diameter
ru: Диаметр

source: Front Angle
ru: Передн. угол

source: Back Angle
ru: Задн. угол

source: Orientation
ru: Ориентация

source: Comment
ru: Описание

source: Toolfile does not exist {}
ru: Файл не существет: {}

source: Delete tool: {}
ru: Удалить инструмент: {}

source: Save line: {}
ru: Сохранить строку: {}

source: Reloading of tool table into linuxcnc: {}
ru: Перезагрузка таблицы инструментов в linuxcnc: {}

source: Entered tool data:{} {} {}
ru: Введенные данные инструмента:{} {} {}

source: Tool offsetpage widget error: MDI call error, {}
ru: Ошибка виджета поправок инструмента: ошибка вызова MDI, {}

source: Invaliad data type in row {} column:{}
ru: Неправильный тип данных в строке {} колонка:{}

source: Docs
ru: Документация

source: Unlock settings
ru: Разблокировать настройки

source: Enter password:
ru: Введите пароль:

source: Unlock
ru: Разблокировать

source: Lock settings
ru: Заблокировать

source: New password:
ru: Новый пароль:

source: Load configuration
ru: Загрузить конфигурацию

source: Save configuration
ru: Сохранить конфигурацию

source: Password changed
ru: Пароль изменен

source: Access granted
ru: Доступ открыт

source: Access denied
ru: Доступ закрыт

source: Fatal exception:
ru: Неисправимое исключение:

source: A fatal exception occurred
ru: Произошло неисправимое исключение

source: <pre>A fatal exception occurred: {} AlterX will be terminated.</pre>
ru: <pre>Произошло неисправимое исключение: {} AlterX будет остановлен.</pre>

source: Show verbose information
ru: Показать дополнительную информацию

source: &Ok
ru: &Ок

source: C&ontinue
ru: П&родолжить

source: &Cancel
ru: &Отмена

source: AlterX version {}
ru: AlterX версия {}

source: Usage: alterx [OPTIONS]
ru: Использование: alterx [OPTIONS]

source: Options:
ru: Опции:

source: -h|--help Print this help text
ru: -h|--help Вывести эту справку

source: -i|--ini Set config file path
ru: -i|--ini Установить путь к конфигурации

source: -L|--loglevel LVL Set the log level:
ru: -L|--loglevel LVL Установить уровень лога:

source: 0: Log nothing
ru: 0: Не записывать

source: 1: Debug logging
ru: 1: Записи отладки

source: 2: Log errors, warnings and info messages
ru: 2: Записи ошибок, предупреждения и информации

source: 3: Log errors and warnings (default)
ru: 3: Записи ошибок и предупреждений (по-умолчанию)

source: 4: Log errors
ru: 4: Записи ошибок

source: 5: Log critical
ru: 5: Критические записи

source: -l|--lang Set locale
ru: -l|--lang Выбор языка

source: -v|--verbose Set verbose output
ru: -v|--verbose Установить расширенный вывод лога

source: AlterX: Config file not found
ru: AlterX: Конфигурационный файл не найден

source: There is no option '--ini config_file_path'.
ru: Нет опции '--ini config_file_path'.

source: Get preference error: {}
ru: Ошибка получения настроек: {}

source: Loglevel: {}
ru: Уровень лога: {}

source: Logfile: {}
ru: Файл лога: {}

source: Locale: {}
ru: Язык: {}

source: Using {} GUI framework
ru: Использование {} GUI фреймворка

source: AlterX: ABORTING due to unhandled exception:
ru: AlterX: ОСТАНОВКА по причине необработанного исключения:

source: AlterX: Unhandled exception
ru: AlterX: Необработанное исключение

source: Run program from line: {}
ru: Запустить программу со строки: {}

source: Button Run from line clicked
ru: Нажата кнопка запуска с строки

source: Button block delete clicked
ru: Нажата кнопка удаления блоков

source: Button optional stop clicked
ru: Нажата кнопка опциональных остановок

source: Button Pause clicked
ru: Нажата кнопка паузы

source: Button program run clicked
ru: Нажата кнопка пуска программы

source: Button Step clicked
ru: Нажата кнопка шага программы

source: Button Stop clicked
ru: Нажата кнопка остановки программы

source: Button delete view clicked
ru: Нажата кнопка удаления просмотра пути

source: Button set view P clicked
ru: Нажата кнопка вида P

source: Button set view X clicked
ru: Нажата кнопка вида X

source: Button set view Y clicked
ru: Нажата кнопка вида Y

source: Button set view Z clicked
ru: Нажата кнопка Z

source: Button zoom plus clicked
ru: Нажата кнопка приближения

source: Button zoom minus clicked
ru: Нажата кнопка отдаления

source: Button geditor new clicked
ru: Нажата кнопка редактора - новый

source: Button geditor redo clicked
ru: Нажата кнопка редактора - повтор

source: Button geditor replace clicked
ru: Нажата кнопка редактора - замена

source: Button geditor save clicked
ru: Нажата кнопка редактора - сохранить

source: Button save as clicked, path: {}
ru: Нажата кнопка сохранить как, путь: {}

source: Button save as clicked
ru: Нажата кнопка сохранить как

source: Button geditor find clicked
ru: Нажата кнопка редактора - поиск

source: Button set replace clicked
ru: Нажата кнопка установки замены

source: Button set search clicked
ru: Нажата кнопка установки поиска

source: Button geditor undo clicked
ru: Нажата кнопка редактора - отмена

source: Button flood clicked, flood disactivated
ru: Нажата кнопка подачи жидкости, жидкость заблокирована

source: Button flood clicked, flood activated
ru: Нажата кнопка подачи жидкости, жидкость активирована

source: Button mist clicked, mist disactivated
ru: Нажата кнопка подачи тумана, туман заблокирован

source: Button mist clicked, mist activated
ru: Нажата кнопка подачи тумана, туман активирован

source: Command Home A
ru: Комманда A в ноль

source: Command Home ALL
ru: Комманда ВСЕ в ноль

source: Command Home B
ru: Комманда B в ноль

source: Command Home C
ru: Комманда C в ноль

source: Command Home X
ru: Комманда X в ноль

source: Command Home Y
ru: Комманда Y в ноль

source: Command Home Z
ru: Комманда Z в ноль

source: Command Unhome ALL
ru: Комманда ВСЕ забыть ноль

source: Button filemanager delete clicked
ru: Нажата кнопка файлменеджера - удалить

source: Are you sure? Click to delete.
ru: Вы уверены? Нажмите для удаления.

source: Button edit page clicked
ru: Нажата кнопка редактора

source: Button filemanager home clicked
ru: Нажата кнопка файлменеджера - в дом

source: Button filemanager jump to clicked
ru: Нажата кнопка файлменеджера - переход

source: Button filemanager next clicked
ru: Нажата кнопка файлменеджера - следующий

source: Button filemanager previous clicked
ru: Нажата кнопка файлменеджера - предыдущий

source: Button filemanager select clicked
ru: Нажата кнопка файлменеджера - выбор

source: Button set JOG 0.001 clicked
ru: Нажата кнопка установить JOG 0.001

source: Button set JOG 0.01 clicked
ru: Нажата кнопка установить JOG 0.01

source: Button set JOG 0.1 clicked
ru: Нажата кнопка установить JOG 0.1

source: Button set JOG 1 clicked
ru: Нажата кнопка установить JOG 1

source: Button JOG activate clicked
ru: Нажата кнопка активировать ручные

source: Button JOG disactivate clicked
ru: Нажата кнопка заблокировать ручные

source: Button JOG incremental clicked
ru: Нажата кнопка инкрементальные ручные

source: Button JOG continuous clicked
ru: Нажата кнопка продолжительные ручные

source: Button JOG joystick clicked
ru: Нажата кнопка джойстик для ручных

source: Button JOG encoder clicked
ru: Нажата кнопка энкодер для ручных

source: Button exit clicked
ru: Нажата кнопка выхода

source: Button macro stop clicked
ru: Нажата кнопка остановки макроса

source: Offset viewer edit X: {}
ru: Поправки редактирование X: {}

source: Offset viewer edit X clicked
ru: Нажата кнопка поправки редактирование X

source: Offset viewer edit Y: {}
ru: Поправки редактирование Y: {}

source: Offset viewer edit Y clicked
ru: Нажата кнопка поправки редактирование Y

source: Offset viewer edit Z: {}
ru: Поправки редактирование Z: {}

source: Offset viewer edit Z clicked
ru: Нажата кнопка поправки редактирование Z

source: Offset viewer next button clicked
ru: Нажата кнопка поправки следующая

source: Offset viewer prev button clicked
ru: Нажата кнопка поправки предыдущая

source: Offset viewer select button clicked
ru: Нажата кнопка поправки выбрать

source: Button zero g92 clicked
ru: Нажата кнопка обнулить g92

source: Settings page next button clicked
ru: Нажата кнопка настройки следующая страница

source: Settings page prev button clicked
ru: Нажата кнопка настройки предыдущая страница

source: Button restart clicked
ru: Нажата кнопка перезапуска

source: Button save log clicked
ru: Нажата кнопка сохранения логов

source: Open log failed: {}
ru: Не удалось открыть лог: {}

source: Open directory
ru: Открыть папку

source: Save log '{}' failed: {}
ru: Не удалось сохранить лог '{}': {}

source: Tool viewer add button clicked
ru: Нажата кнопка инструмент добавить

source: Tool viewer change tool button clicked
ru: Нажата кнопка инструмент сменить

source: Tool viewer delete button clicked
ru: Нажата кнопка инструмент удалить

source: Tool viewer edit: {}
ru: Редактирование инструмента: {}

source: Tool viewer edit clicked
ru: Нажата кнопка инструмент редактировать

source: Tool viewer index tool button clicked
ru: Нажата кнопка инструмент применить индекс

source: Tool viewer left button clicked
ru: Нажата кнопка инструмент влево

source: Tool viewer next button clicked
ru: Нажата кнопка инструмент следующий

source: Tool viewer prev button clicked
ru: Нажата кнопка инструмент предыдущий

source: Tool viewer right button clicked
ru: Нажата кнопка инструмент вправо
